//常用正则
export const regExp = {
  // 有效数字
  validNum: /^-?(\d|([1-9]\d+))(\.\d+)?$/,
  // 手机
  mobile: /^1[3-9]([0-9]{9})$/,
  // 邮箱
  email: /^\w+((-\w+)|(\.\w+))*@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+$/,
  // 身份证
  idCard: /(^\d{15}$)|(^\d{17}(\d|X)$)/,
  // url地址
  url: /^((https|http|ftp|rtsp|mms)?:\/\/)+[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"])*$/,
  //注册密码
  password: /^\w{6,16}$/,
  // qq
  qq: /^[1-9][0-9]{4,}$/,
  //邮编
  postcode: /^[0-9]{6}$/,
  //座机
  telephone: /\d{3}-\d{8}|\d{4}-\d{7}/,
  //座机2
  telephone2: /0\d{2,3}-\d{7,8}/,
  //钱
  charge: /^(\d|([1-9]\d+))(\.\d{1,2})?$/,
  //正整数
  num: /^[+]{0,1}(\d+)$/,
  //价格
  price: /(^[1-9]\d*(\.\d{1,2})?$)|(^0(\.\d{1,2})?$)/,
  //银行卡
  bankcard: /^([1-9])(\d{10,30})$/,
  //昵称
  name: /^[\u4E00-\u9FA5A-Za-z0-9]+$/
};
